intent_keywords = {
    "education.yml": [
        "ترم تابستانی", "تابستونی", "پروژه تابستانی", "نمرات تابستانی", 
        "محدودیت واحد", "غیبت", "غیبت موجه", "تعداد غیبت", 
        "استاد راهنما", "تغییر استاد راهنما", "تعیین استاد راهنما", "ادامه پروژه"
    ],
    "education2.yml": [
        "فارغ التحصیلی", "تسویه حساب", "پایان نامه", "حذف ترم", "مهلت حذف", 
        "سنوات", "برنامه کلاس", "بارگذاری مدارک", "تغییر رشته"
    ],
    "finance.yml": [
        "وام دانشجویی", "بدهی دانشگاه", "صندوق رفاه", "پرداخت بدهی", 
        "وام مسکن", "بررسی کارشناس", "وضعیت پرداخت", "معاون دانشجویی"
    ],
    "golestan.yml": [
        "سامانه گلستان", "ارزیابی اساتید", "سرترم", "واکسیناسیون", 
        "ریز نمرات", "رتبه تحصیلی", "فراموشی رمز", "ویرایش اطلاعات"
    ],
    "misc.yml": [
        "تمدید سنوات", "انصراف", "گواهی اشتغال", "کد ملی", 
        "کمیسیون موارد خاص", "مهمانی", "اتوماسیون تغذیه", "رمز تغذیه"
    ],
    "units.yml": [
        "انتخاب واحد", "ظرفیت", "دروس عمومی", "معارف", "سرترم", "همنیاز"
    ],
}
